tutorials/battery_samples/dp-case1/system/battery1/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


T
{
    internalField   uniform 0;

    boundaryField
    {
        inlet
        {
            type            fixedValue;
            value           uniform 0;
        }

        outlet
        {
            type            fixedValue;
            inletValue      uniform 0;
        }

        walls
        {
            type            zeroGradient;
            value           uniform 0;
        }

        "battery_to.*"
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            //Tnbr            T;
            //kappaMethod     solidThermo;
            value           uniform 300;
        }
    }
}


p
{
    internalField   uniform 0;

    boundaryField
    {
        walls
        {
            type           zeroGradient;
            value           uniform 0;
        }
        
         "battery_to.*"
        {
            type    zeroGradient;
            value    uniform 0;
        }
    }
}

// ************************************************************************* //
