tutorials/battery_samples/dp-case1/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // battery1
    {
        name    battery1CellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.100 0 0.060)(0.231 0.016 0.125);
        }
    }
    
    {
        name    battery1CellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
            box (0.100 -100 0.060)(0.231 0.016 0.125);
        }
    }
   
    {
        name    battery1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set battery1CellSet;
        }
    }


    // bottomWater is all the other cells
    // Air
    {
        name    AirCellSet;
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set battery1CellSet;
        }
    }

    {
        name    AirCellSet;
        type    cellSet;
        action  invert;
    }
    {
        name    Air;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set AirCellSet;
        }
    }
);


// ************************************************************************* //
